/* Search criteria for other date properties of a file, such as when a photograph was taken, within a specific period before today */
"%@ %[Any Date]@" = "%1$@ %2$[Beliebiges Datum]@";
"%@ %[Today]@" = "%1$@ %2$[Heute]@";
"%@ %[Since Yesterday]@" = "%1$@ %2$[Seit gestern]@";
"%@ %[This week]@" = "%1$@ %2$[Diese Woche]@";
"%@ %[Within Last 2 weeks]@" = "%1$@ %2$[Innerhalb der letzten 2 Wochen]@";
"%@ %[This month]@" = "%1$@ %2$[Diesen Monat]@";
"%@ %[Within Last 2 months]@" = "%1$@ %2$[Innerhalb der letzten 2 Monate]@";

/* Search criteria for other boolean properties of a file, such as whether red-eye correction was on */
"%@ %[Any]@" = "%1$@ %2$[Beliebig]@";
"%@ %[Yes]@" = "%1$@ %2$[Ja]@";
"%@ %[No]@" = "%1$@ %2$[Nein]@";

/* Search criteria for other string properties of a file, such as the name of the author */
"%@ %[Contains]@ %@" = "%1$@ %2$[Enthält]@ %3$@";
"%@ %[Begins With]@ %@" = "%1$@ %2$[Beginnt mit]@ %3$@";
"%@ %[Ends With]@ %@" = "%1$@ %2$[Endet mit]@ %3$@";
"%@ %[Is]@ %@" = "%1$@ %2$[Ist]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, on a specific date */
"%@ %[Exactly]@ %@" = "%1$@ %2$[Genau am]@ %3$@";
"%@ %[Before]@ %@" = "%1$@ %2$[Vor]@ %3$@";
"%@ %[After]@ %@" = "%1$@ %2$[Nach]@ %3$@";

/* Search criteria for other numerical properties of a file, such as the pixel height of an image */
"%@ %[Greater than]@ %@" = "%1$@ %2$[Mehr als]@ %3$@";
"%@ %[Less than]@ %@" = "%1$@ %2$[Weniger als]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, within a user-specified period of time before today */
"%@ %[Within Last]@ %@ %[Days]@" = "%1$@ %2$[Innerhalb der letzten]@ %3$@ %4$[Tage]@";
"%@ %[Within Last]@ %@ %[Weeks]@" = "%1$@ %2$[Innerhalb der letzten]@ %3$@ %4$[Wochen]@";
"%@ %[Within Last]@ %@ %[Months]@" = "%1$@ %2$[Innerhalb der letzten]@ %3$@ %4$[Monate]@";
"%@ %[Within Last]@ %@ %[Years]@" = "%1$@ %2$[Innerhalb der letzten]@ %3$@ %4$[Jahre]@";

/* Search criteria for other color space properties of a file */
"%[Color Space]@ %[Any Color Space]@" = "%1$[Farbraum]@ %2$[Beliebiger Farbraum]@";
"%[Color Space]@ %[RGB]@" = "%1$[Farbraum]@ %2$[RGB]@";
"%[Color Space]@ %[CMYK]@" = "%1$[Farbraum]@ %2$[CMYK]@";
"%[Color Space]@ %[Grayscale]@" = "%1$[Farbraum]@ %2$[Graustufen]@";

/* Search criteria for files by contents */
"%[Contents]@ contain %@" = "%1$[Inhalt]@ enthält %2$@";

/* Search criteria for time duration - minutes and seconds */
"%[Duration]@ %[Greater than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Dauer]@ %2$[Größer als]@ %3$@ %4$[Min]@ %5$@ %6$[Sek]@";
"%[Duration]@ %[Less than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Dauer]@ %2$[Weniger als]@ %3$@ %4$[Min]@ %5$@ %6$[Sek]@";

/* Search criteria for files by keyword */
"%[Keywords]@ %@" = "%1$[Schlagwörter]@ %2$@";

/* Search criteria for files by keyword containing */
"%[Keywords]@ contain %@" = "%1$[Schlagwörter]@ enthalten %2$@";

/* Search criteria for specific kinds of files */
"%[Kind]@ is %[Any]@" = "%1$[Art]@ ist %2$[Beliebig]@";
"%[Kind]@ is %[Images]@" = "%1$[Art]@ ist %2$[Bilder]@";
"%[Kind]@ is %[Text]@" = "%1$[Art]@ ist %2$[Text]@";
"%[Kind]@ is %[PDF]@" = "%1$[Art]@ ist %2$[PDF]@";
"%[Kind]@ is %[Movies]@" = "%1$[Art]@ ist %2$[Filme]@";
"%[Kind]@ is %[Music]@" = "%1$[Art]@ ist %2$[Musik]@";
"%[Kind]@ is %[Documents]@" = "%1$[Art]@ ist %2$[Dokumente]@";
"%[Kind]@ is %[Presentations]@" = "%1$[Art]@ ist %2$[Präsentationen]@";
"%[Kind]@ is %[Folders]@" = "%1$[Art]@ ist %2$[Ordner]@";
"%[Kind]@ is %[Applications]@" = "%1$[Art]@ ist %2$[Programme]@";

/* Search criteria for other kinds of files */
"%[Kind]@ is %[Others...]@ %@" = "%1$[Art]@ ist %2$[Andere ...]@ %3$@";

/* Search criteria for files by a particular label (color) */
"%[Label]@ is %@" = "%1$[Etikett]@ ist %2$@";

/* Search criteria for dates a fixed amount relative to today */
"%[Last Opened]@ %[Any Date]@" = "%1$[Zuletzt geöffnet]@ %2$[An beliebigem Datum]@";
"%[Last Modified]@ %[Any Date]@" = "%1$[Zuletzt geändert]@ %2$[An beliebigem Datum]@";
"%[Created]@ %[Any Date]@" = "%1$[Erstellt]@ %2$[An beliebigem Datum]@";
"%[Last Opened]@ %[Today]@" = "%1$[Zuletzt geöffnet]@ %2$[Heute]@";
"%[Last Modified]@ %[Today]@" = "%1$[Zuletzt geändert]@ %2$[Heute]@";
"%[Created]@ %[Today]@" = "%1$[Erstellt]@ %2$[Heute]@";
"%[Last Opened]@ %[Since Yesterday]@" = "%1$[Zuletzt geöffnet]@ %2$[Seit gestern]@";
"%[Last Modified]@ %[Since Yesterday]@" = "%1$[Zuletzt geändert]@ %2$[Seit gestern]@";
"%[Created]@ %[Since Yesterday]@" = "%1$[Erstellt]@ %2$[Seit gestern]@";
"%[Last Opened]@ %[This week]@" = "%1$[Zuletzt geöffnet]@ %2$[Diese Woche]@";
"%[Last Modified]@ %[This week]@" = "%1$[Zuletzt geändert]@ %2$[Diese Woche]@";
"%[Created]@ %[This week]@" = "%1$[Erstellt]@ %2$[Diese Woche]@";
"%[Last Opened]@ %[Within Last 2 weeks]@" = "%1$[Zuletzt geöffnet]@ %2$[Innerhalb der letzten 2 Wochen]@";
"%[Last Modified]@ %[Within Last 2 weeks]@" = "%1$[Zuletzt geändert]@ %2$[Innerhalb der letzten 2 Wochen]@";
"%[Created]@ %[Within Last 2 weeks]@" = "%1$[Erstellt]@ %2$[Innerhalb der letzten 2 Wochen]@";
"%[Last Opened]@ %[This month]@" = "%1$[Zuletzt geöffnet]@ %2$[Diesen Monat]@";
"%[Last Modified]@ %[This month]@" = "%1$[Zuletzt geändert]@ %2$[Diesen Monat]@";
"%[Created]@ %[This month]@" = "%1$[Erstellt]@ %2$[Diesen Monat]@";
"%[Last Opened]@ %[Within Last 2 months]@" = "%1$[Zuletzt geöffnet]@ %2$[Innerhalb der letzten 2 Monate]@";
"%[Last Modified]@ %[Within Last 2 months]@" = "%1$[Zuletzt geändert]@ %2$[Innerhalb der letzten 2 Monate]@";
"%[Created]@ %[Within Last 2 months]@" = "%1$[Erstellt]@ %2$[Innerhalb der letzten 2 Monate]@";

/* Search criteria for specific dates */
"%[Last Opened]@ %[Exactly]@ %@" = "%1$[Zuletzt geöffnet]@ %2$[Genau am]@ %3$@";
"%[Last Modified]@ %[Exactly]@ %@" = "%1$[Zuletzt geändert]@ %2$[Genau am]@ %3$@";
"%[Created]@ %[Exactly]@ %@" = "%1$[Erstellt]@ %2$[Genau am]@ %3$@";
"%[Last Opened]@ %[Before]@ %@" = "%1$[Zuletzt geöffnet]@ %2$[Vor dem]@ %3$@";
"%[Last Modified]@ %[Before]@ %@" = "%1$[Zuletzt geändert]@ %2$[Vor dem]@ %3$@";
"%[Created]@ %[Before]@ %@" = "%1$[Erstellt]@ %2$[Vor dem]@ %3$@";
"%[Last Opened]@ %[After]@ %@" = "%1$[Zuletzt geöffnet]@ %2$[Nach dem]@ %3$@";
"%[Last Modified]@ %[After]@ %@" = "%1$[Zuletzt geändert]@ %2$[Nach dem]@ %3$@";
"%[Created]@ %[After]@ %@" = "%1$[Erstellt]@ %2$[Nach dem]@ %3$@";

/* Search criteria for dates a variable amount relative to today */
"%[Last Opened]@ %[Within Last]@ %@ %[Days]@" = "%1$[Zuletzt geöffnet]@ %2$[Innerhalb der letzten]@ %3$@ %4$[Tage]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Days]@" = "%1$[Zuletzt geändert]@ %2$[Innerhalb der letzten]@ %3$@ %4$[Tage]@";
"%[Created]@ %[Within Last]@ %@ %[Days]@" = "%1$[Erstellt]@ %2$[Innerhalb der letzten]@ %3$@ %4$[Tage]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Zuletzt geöffnet]@ %2$[Innerhalb der letzten]@ %3$@ %4$[Wochen]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Zuletzt geändert]@ %2$[Innerhalb der letzten]@ %3$@ %4$[Wochen]@";
"%[Created]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Erstellt]@ %2$[Innerhalb der letzten]@ %3$@ %4$[Wochen]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Months]@" = "%1$[Zuletzt geöffnet]@ %2$[Innerhalb der letzten]@ %3$@ %4$[Monate]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Months]@" = "%1$[Zuletzt geändert]@ %2$[Innerhalb der letzten]@ %3$@ %4$[Monate]@";
"%[Created]@ %[Within Last]@ %@ %[Months]@" = "%1$[Erstellt]@ %2$[Innerhalb der letzten]@ %3$@ %4$[Monate]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Years]@" = "%1$[Zuletzt geöffnet]@ %2$[Innerhalb der letzten]@ %3$@ %4$[Jahre]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Years]@" = "%1$[Zuletzt geändert]@ %2$[Innerhalb der letzten]@ %3$@ %4$[Jahre]@";
"%[Created]@ %[Within Last]@ %@ %[Years]@" = "%1$[Erstellt]@ %2$[Innerhalb der letzten]@ %3$@ %4$[Jahre]@";

/* Search criteria for musical genre type */
"%[Musical genre]@ %@" = "%1$[Genre]@ %2$@";

/* Search criteria for name extension type */
"%[Name Extension]@ %@" = "%1$[Suffix]@ %2$@";

/* Search criteria for files by name */
"%[Name]@ %[Contains]@ %@" = "%1$[Name]@ %2$[Enthält]@ %3$@";
"%[Name]@ %[Begins With]@ %@" = "%1$[Name]@ %2$[Beginnt mit]@ %3$@";
"%[Name]@ %[Ends With]@ %@" = "%1$[Name]@ %2$[Endet mit]@ %3$@";
"%[Name]@ %[Is]@ %@" = "%1$[Name]@ %2$[Ist]@ %3$@";

/* Search criteria for other color space properties of a file */
"%[Orientation]@ %[Any Orientation]@" = "%1$[Ausrichtung]@ %2$[Beliebige Ausrichtung]@";
"%[Orientation]@ %[Landscape]@" = "%1$[Ausrichtung]@ %2$[Querformat]@";
"%[Orientation]@ %[Portrait]@" = "%1$[Ausrichtung]@ %2$[Hochformat]@";

/* Menu item to bring up an additional list of search criteria */
"%[Other...]@" = "%[Weitere …]@";

/* Search criteria for raw query type */
"%[Raw query]@ %@" = "%1$[Reine Daten]@ %2$@";

/* Search criteria for generic search-by-all-fields type */
"%[Search for]@ %@" = "%1$[Suchen nach]@ %2$@";

/* Search criteria for files larger or smaller than a specific number of kilobytes, megabytes, or gigabytes */
"%[Size]@ %[Greater than]@ %@ %[KB]@" = "%1$[Größe]@ %2$[Größer als]@ %3$@ %4$[KB]@";
"%[Size]@ %[Less than]@ %@ %[KB]@" = "%1$[Größe]@ %2$[Kleiner als]@ %3$@ %4$[KB]@";
"%[Size]@ %[Greater than]@ %@ %[MB]@" = "%1$[Größe]@ %2$[Größer als]@ %3$@ %4$[MB]@";
"%[Size]@ %[Less than]@ %@ %[MB]@" = "%1$[Größe]@ %2$[Kleiner als]@ %3$@ %4$[MB]@";
"%[Size]@ %[Greater than]@ %@ %[GB]@" = "%1$[Größe]@ %2$[Größer als]@ %3$@ %4$[GB]@";
"%[Size]@ %[Less than]@ %@ %[GB]@" = "%1$[Größe]@ %2$[Kleiner als]@ %3$@ %4$[GB]@";

/* Search criteria for other visibility properties of a file */
"%[Visibility]@ %[Visible or Invisible]@" = "%1$[Sichtbarkeit]@ ist %2$[sichtbar oder unsichtbar]@";
"%[Visibility]@ %[Visible Items]@" = "%1$[Sichtbarkeit]@ ist %2$[unsichtbar]@";
"%[Visibility]@ %[Invisible Items]@" = "%1$[Sichtbarkeit]@ ist %2$[unsichtbar]@";

